export const departments = [
    {id: 1, department: 'Разработка', owner: 'Новиков Д.В.', title: 'Разработка', amount: 1},
    {id: 2, department: 'Продвижение СБИС', owner: 'Кошелев А.Е.', title: 'Продвижение СБИС', amount: 10},
    {id: 3, department: 'Федеральная клиентская служка', owner: 'Мануйлова Ю.А.', title: 'Федеральная клиентская служка', amount: 100},
    {id: 4, department: 'Служба эксплуатации', owner: 'Субботин А.В.', title: 'Служба эксплуатации', amount: 15},
    {id: 5, department: 'Технологии и маркетинг', owner: 'Чеперегин А.С.', title: 'Технологии и маркетинг', amount: 11},
    {id: 6, department: 'Федеральный центр продаж. Call-центр Ярославль', owner: 'Кошелев А.Е.', title: 'Федеральный центр продаж. Call-центр Ярославль', amount: 150},
    {id: 7, department: 'Сопровождение информационных систем', owner: 'Кошелев А.Е.', title: 'Сопровождение информационных систем', amount: 18}
];
